NicoHood/HoodLoader2/avr/boards.txt
#HoodLoader2 boards.txt file

menu.cpu=Processor
menu.usbcore=USB Core
menu.board=BootLoader

HoodLoader2.name=HoodLoader2
HoodLoader2.build.core=arduino:arduino
HoodLoader2.bootloader.tool=arduino:avrdude
HoodLoader2.upload.tool=arduino:avrdude

#uploading settings
HoodLoader2.upload.speed=57600
HoodLoader2.upload.protocol=avr109
HoodLoader2.upload.disable_flushing=true
HoodLoader2.upload.use_1200bps_touch=true
HoodLoader2.upload.wait_for_upload_port=true

#fuses
HoodLoader2.bootloader.low_fuses=0xFF
HoodLoader2.bootloader.high_fuses=0xD9
HoodLoader2.bootloader.extended_fuses=0xF4
HoodLoader2.bootloader.unlock_bits=0x3F
HoodLoader2.bootloader.lock_bits=0x2F

#general settings for all boards:
HoodLoader2.build.board=HOODLOADER2
HoodLoader2.build.f_cpu=16000000L
HoodLoader2.vid.0=0x2341
HoodLoader2.pid.0=0x484C

#TODO, seems to not work correctly, placed in pins_arduino.h?
#HoodLoader2.build.vid=0x2341
#HoodLoader2.build.pid=0x484C
#HoodLoader2.build.usb_product="HoodLoader 2"
#HoodLoader2.build.usb_manufacturer="NicoHood"
#HoodLoader2.build.extra_flags={build.usb_flags}


#MCU selection:
#16u2
HoodLoader2.menu.cpu.HL2_16u2=ATmega16u2
HoodLoader2.menu.cpu.HL2_16u2.upload.maximum_size=12288
HoodLoader2.menu.cpu.HL2_16u2.upload.maximum_data_size=512
HoodLoader2.menu.cpu.HL2_16u2.build.mcu=atmega16u2
HoodLoader2.menu.cpu.HL2_16u2.build.variant=HoodLoader2_16u2
#HoodLoader2.menu.cpu.HL2_16u2.bootloader.path=16u2

#at90usb162
HoodLoader2.menu.cpu.HL2_at90usb162=at90usb162
HoodLoader2.menu.cpu.HL2_at90usb162.upload.maximum_size=12288
HoodLoader2.menu.cpu.HL2_at90usb162.upload.maximum_data_size=512
HoodLoader2.menu.cpu.HL2_at90usb162.build.mcu=at90usb162
HoodLoader2.menu.cpu.HL2_at90usb162.build.variant=HoodLoader2_16u2
#HoodLoader2.menu.cpu.HL2_at90usb162.bootloader.path=16u2

#32u2
HoodLoader2.menu.cpu.HL2_32u2=ATmega32u2
HoodLoader2.menu.cpu.HL2_32u2.upload.maximum_size=28672
HoodLoader2.menu.cpu.HL2_32u2.upload.maximum_data_size=1024
HoodLoader2.menu.cpu.HL2_32u2.build.mcu=atmega32u2
HoodLoader2.menu.cpu.HL2_32u2.build.variant=HoodLoader2_32u2
#HoodLoader2.menu.cpu.HL2_32u2.bootloader.path=32u2


#USB core selection
HoodLoader2.menu.usbcore.USB_CORE=Serial + HID
HoodLoader2.menu.usbcore.USB_CORE.build.variant=HoodLoader2
HoodLoader2.menu.usbcore.NO_USB=No USB functions
HoodLoader2.menu.usbcore.NO_USB.build.variant=HoodLoader2_NoUSB


#Board selection (only important for burning bootloaders)
#HL2 Uno
HoodLoader2.menu.board.uno=HoodLoader2 Uno
HoodLoader2.menu.board.uno.bootloader.file=Hoodloader2_Uno_Beta.hex

#HL2 Mega
HoodLoader2.menu.board.mega2560=HoodLoader2 Mega
HoodLoader2.menu.board.mega2560.bootloader.file=Hoodloader2_Mega_Beta.hex

#CDC
HoodLoader2.menu.board.cdc=CDC BootLoader
HoodLoader2.menu.board.cdc.bootloader.file=BootloaderCDC_atusb162.hex

#CDC Mattair
HoodLoader2.menu.board.cdcm=CDC Mattair BootLoader
HoodLoader2.menu.board.cdcm.bootloader.file=BootloaderMattairtech.hex

#DFU
HoodLoader2.menu.board.dfu=DFU + USB-Serial BootLoader
HoodLoader2.menu.board.dfu.bootloader.file=Arduino-COMBINED-dfu-usbserial-atmega16u2-Uno-Rev3.hex
